# W  = 315
# h = 3072
# V = 735 * 1024 * 8 #kbait
# I = V / (W * h)
# print(I)

# * w * h = 315 * 3072
# * N = 2000=> 2 ** i = > i = 11 bit
# * V = w * h * i
# * Nmax = 2 ^ i
# * i + v / (w * h)
# & музыкальный файл
# * V = n * f * i * t
# * n - формат (моно - 1, стерео - 2, куадро - 4)
# * f - Гц (если кГц то умножаем на 1000)
# * i разрешение ( бит)
# * t время ( секкунды)
# h = 1024
# w = 768
# N = 4096
# i = 12
# g = 1310720
# t = 300
# G = g * t / (w * h * i)
# print(G)

# n = 48000
# g = 314572800
# t = 2540
# i = 34
# L = 2
# V = 110 * 1024 * 8
# w = 13
# G = n * t * i * L + w * V
# p = G  / g
# print(p)

# w = 315
# h = 3074
# V = 735 * 8 * 1024
# i = V / (w * h)
# print(i)

# f = 192 * 1000
# V = 967 * 1024 * 1024 * 8
# i = 16
# n = 4
# t = V / (f * n * i)
# print(t / 60)

# t = 270 #sek
# q = 43200 * 8
# f = 96000
# i = 24
# n = 4
# p =  f * i * n * t / q
# print(p / 3600)

# w = 1024
# h = 768
# q = 65536
# i = 3 * 8
# t = w * h * i / q
# print(t)

# f = 44000
# n = 2
# i = 24
# V = 121 * 1024 * 1024 * 8
# t = V / (f * n * i)
# print(t)

# w = 1280
# h = 1024
# n = 39
# q = 1966080
# t = 280
# V = q * t / n
# i = V / ( w * h )
# print(i)

# w = 1024
# h = 768
# q = 1310720
# t = 300
# N = 4096
# i = 12
# v = q * t
# W = v / (w * h * i)
# print(W)

