#математические аператоры
#сложения
a=5
a=a + 10 #обычное сложения
a +=10 #сокращеннвя запесь
print(f"Сложение:{a}")

# вычитание
a = 15
a = a - 10 # обычное
a -= 10 # сокращенная запись
print(f"Вычитание: {a}")

# умножения
a = 15
a = a * 10 # обычное
a *= 10 # сокращенная запись
print(f"умножение: {a}")

#деления
a = 15
a = a / 10 # обычное
a /= 10 # сокращенная запись
print(f"деления: {a}")

# цело числиное деления
#деления
a = 15
a = a // 10 # обычное
a //= 10 # сокращенная запись
print(f" Целочисленное деления: {a}")

# остаток от деления
# целочисленное деление
a = 5
a = a % 2 # обычное
a %= 2 # сокращенная запись
print(f"Целочисленное деление: {a}")

#возведения в степень
a = 5
a = a ** 2 # обычное
a **= 2 # сокращенная запись
print(f"степень: {a}")

# модуль
a = abs(-5) #обычные
print(f"модуль: {a}")

# ошибки
# на 0 делить нельзя
print(10/0)
# несовместимые типы данных
print(1+ '1')
# проблемы с точностью
print(0.1 + 0.2)

